package com.example.user.history;


public class QuestionLibrary {

    private String mQuestions [] = {
            "Фетишизм - це...",
            "Найвідоміші археологічні культури: ",
            "________ - германськы племена, які переселилися на українські землі під впливом римської агресивної політики",
            "Кожне місто-колонія ділилося на: ",
            "Неолітична революція - це.. ",
            "Відноситься місто Олівія до міста-Держав Північного Причорномор'я",

            "________ - сформоване населення в середині І тис. до н.е., представлене зарубинецькою, черняхівською та іншими археологічними культурами ",
            "Слов'яни діляться на: ",
            "Південні слов'яни це: ",
            "Князь ________ (964-972 рр.) здійснив багато воєнних походів. Внаслідок цього територія Київської Русі значно розширилася, а її кордони були укріплені.",
            "Виберіть реальний факт із запропонованих тверджень",
            "Які існують теорії походження слов'ян?",



            "The _______ holds the plant upright."


    };


    private String mChoices [][] = {
            {"віра в духів", "віра в походження людини від рослини(тварини)", "наділення надприродними силами предметів"},
            {"кімерійська та ямна", "трипільська, ямна та середньострогівська", "трипільська"},
            {"готи", "скіфи", "сармати"},
            {"агору, теменос, акрополь", "агору, теменос, акрополь та хору", "акрополь"},
            {"перехід від привласнювальних форм господарства до відтворювальних", "перехід від відтворювальних форм господарства до привласнювальних", "перехід від мисливства дл збиральництва"},
            {"так", "ні", "частково"},

            {"поляни", "сіверяни", "слов'яни"},
            {"східні та західні", "західні та південні", "східні, західні та південні"},
            {"болгари та македонці", "поляки, словаки та чехи", "українці, білоруси та росіяни"},
            {"Ігор", "Святослав", "Олег"},
            {"княгиня Ольга жорстоко помстилася древлянам за смерть Діра", "князь Ігор поширив владу на південний Крим і Тамань", "князь Олег включив до складу Київської Русі південно-руські племінні князівства сіверян, радимичів, словен, кривичів, древлян, дулібів і хорватів"},
            {"міграційна, автохтонна, пантюркистська, норманська та дремлянська", "міграційна, автохтонна, пантюркистська та норманська", "норманська та міграційна"},





            {"Flower", "Leaves", "Stem"}
    };



    private String mCorrectAnswers[] = {
            "наділення надприродними силами предметів",
            "трипільська, ямна та середньострогівська",
            "готи",
            "агору, теменос, акрополь та хору",
            "перехід від привласнювальних форм господарства до відтворювальних",
            "так",

            "слов'яни",
            "східні, західні та південні",
            "болгари та македонці",
            "Святослав",
            "князь Олег включив до складу Київської Русі південно-руські племінні князівства сіверян, радимичів, словен, кривичів, древлян, дулібів і хорватів",
            "міграційна, автохтонна, пантюркистська та норманська",






            "Готи",};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
