package com.example.user.history;


public class QuestionLibrary_2 {

    private String mQuestions [] = {
            "Об’єднання Галицького князівства за Володимира Володаровича.",
            "Об`єднання Галицького та Волинського князівств в єдину державу Романом Мстиславичем.",
            "Коли відбулася битва під Дорогичином?",
            "Коли відбулася битва на Синіх Водах?",
            "Коли відбулася Грюнвальдська битва?",
            "Перший Литовський Статут 1529",
            "Коли була укладена Люлінська унія?",
            "Коли було утворення греко-католицької церкви.",
            "Братства – це",
            "Коли відбулося захоплення Перекопа?",
            "Роки правління  Петра Конашевича-Сагайдачного?",
            "Коли відбулася битва під Хотином?",




            "The _______ holds the plant upright."


    };


    private String mChoices [][] = {
            {"1141 р.", "1152 р.", "1145 р."},
            {"1194 р.", "1191 р.", "1193 р."},
            {"1233 р.", "1239 р.", "1238 р."},
            {"1362 р.", "1366 р.", "1361 р."},
            {"1411 р.", "1410 р.", "1413 р."},
            {"1529 р.", "1525 р.", "1533 р."},

            {"1569 р.", "1563 р.", "1562 р."},
            {"1596 р.", "1599 р.", "1591 р."},
            {"громадські організації православного міщанства", "угрупування людей с однаковою мрією", "громадські організації греко-католицького міщанства"},
            {"1609 р.", "1606 р.", "1608 р."},
            {"1616 – 1622 рр.", "1619 – 1628 рр.", "1612 – 1620 рр."},
            {"1624 р.", "1621 р.", "1627 р."},





            {"Flower", "Leaves", "Stem"}
    };



    private String mCorrectAnswers[] = {
            "1141 р.",
            "1191 р.",
            "1238 р.",
            "1362 р.",
            "1410 р." ,
            "1529 р.",

            "1569 р.",
            "1596 р.",
            "громадські організації православного міщанства",
            "1608 р.",
            "1616 – 1622 рр.",
            "1621 р.",






            "Готи",};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
