package com.example.user.history;


public class QuestionLibrary_3 {

    private String mQuestions [] = {
            "Рушійні сили національно-визвольної війни",
            "Битва на Жовтих Водах",
            "Битва під Корсунем",
            "Битва під Пилявцями",
            "Коли розпочалася облога Львова під проводом Б. Хмельницького?",
            "Коли Б. Хмельницький урочисто в`їхав до Київа?",
            "Коли відбулася Охматівська битва?",
            "Коли було укладене Віленське перемир'я?",
            "Між ким було укладене Віленське перемир'я?",
            "Коли відбулося укладення угоди про військовий союз між Україною та Трансільванією?",
            "Покращення міжнародних відносин зі Швецією.",
            "Рік смерті Б. Хмельницького?",



            " "


    };


    private String mChoices [][] = {
            {"козацтво", "церковництво", "католицьке духівництво"},
            {"5-6 травня", "10-17 травня", "7-9 червня"},
            {"22-27 травня", "15-16 травня", "10-21 червня"},
            {"16-18 вересня", "12-16 грудня", "11-13 вересня"},
            {"26 вересня 1648 р.", "27 вересня 1647 р.", "26 липня 1649 р."},
            {"17 жовтня 1648 р.", "24 грудня 1648 р.", "23 грудня 1648 р."},

            {"січень 1655 р.", "березень 1655 р.", "січень 1656 р."},
            {"1658 р.", "1656 р.", "1659 р."},
            {"було укладене між київським князем та московським царем", "було укладено між московським царем та польським королем.", "було укладене між Б. Хмельницьким та польським королем."},
             {"8 жовтня 1656 р.", "8 жовтня 1657 р.", "10 жовтня 1656 р."},
            {"1657 р.", "1656 р.", "1659 р."},
            {"1657 р.", "1650 р.", "1655 р."},





            {"", "", ""}
    };



    private String mCorrectAnswers[] = {
            "козацтво",
            "5-6 травня",
            "15-16 травня",
            "11-13 вересня",
            "26 вересня 1648 р.",
            "23 грудня 1648 р.",

            "січень 1655 р.",
            "1656 р.",
            "було укладено між московським царем та польським королем.",
            "8 жовтня 1656 р.",
            "1656 р.",
            "1657 р.",






            "",};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
